In [1]:
# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

# Visualización
# ------------------------------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns

# Evaluar linealidad de las relaciones entre las variables
# ------------------------------------------------------------------------------
from scipy.stats import shapiro, kstest

# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Gestión de los warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

In [2]:
df = pd.read_csv("raw_data_limpio.csv", index_col= 0) ## de cara a la exportación para no duplicar el index fantasma

In [ ]:
# QUEDA - si `overtime` deberia ser fillna a 'no' o 'unknown' -- esta abajo en replace comentado
# FALTA - limpiar/sacar informacion de `roledepartment` porque está destinada a eliminación

**Transformamos: quitamos $ y cambiamos "," por "."**

`sameasmonthlyincome`, `salary`, `monthlyincome`, `monthlyrate`, `performancerating`, `worklifebalance`, `totalworkingyears`, `yearsincurrentrole`

In [4]:
lista_errores = []

def cambiar_comas(dato):
    try:
        # Primero quitamos el símbolo $, luego cambiamos coma por punto
        dato_limpio = dato.replace("$", "").replace(",", ".")
        return float(dato_limpio)
    except:
        lista_errores.append(dato)
        return np.nan

In [5]:
lista_col = ["sameasmonthlyincome",  "salary", "monthlyincome", "monthlyrate", "performancerating", "worklifebalance", "totalworkingyears", "yearsincurrentrole"]

In [6]:
for col in lista_col:
    print(col)
    df[col] = df[col].apply(cambiar_comas)

sameasmonthlyincome
salary
monthlyincome
monthlyrate
performancerating
worklifebalance
totalworkingyears
yearsincurrentrole

In [7]:
df[["sameasmonthlyincome",  "salary", "monthlyincome", "monthlyrate", "performancerating", "worklifebalance", "totalworkingyears", "yearsincurrentrole"]]

,sameasmonthlyincome,salary,monthlyincome,monthlyrate,performancerating,worklifebalance,totalworkingyears,yearsincurrentrole
age,,,,,,,,
51,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
52,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
42,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
47,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
46,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
43,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
47,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
47,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
32,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Transformamos: redondeamos a 2 decimales `hourlyrate`, `dailyrate`**

In [8]:
def redondear_dos_decimales(valor):
    try:
        return round(float(valor), 2)
    except:
        return np.nan

In [9]:
columnas_a_redondear = ["hourlyrate", "dailyrate"]

In [10]:
for col in columnas_a_redondear:
    print(col)
    df[col] = df[col].apply(redondear_dos_decimales)

hourlyrate
dailyrate

In [11]:
df[["dailyrate", "hourlyrate"]]

     dailyrate  hourlyrate
age
51     2015.72         NaN
52     2063.39         NaN
42     1984.25         NaN
47     1771.40         NaN
46     1582.77         NaN
..         ...         ...
43      488.94         NaN
47     1973.98         NaN
29      290.04         NaN
47     1032.49         NaN
32      556.26       69.53

[1678 rows x 2 columns]

**Transformamos: modificamos columnas a minuscula**

`"department`, `educationfield`, `attrition`, `jobrole`, `maritalstatus`, `over18`, `overtime`, `standardhours`, `roledepartament`, `remotework`

In [12]:
cambios_a_minuscula = ["department", "educationfield", "attrition", "jobrole", "maritalstatus", "over18", "overtime", "standardhours", "roledepartament", "remotework"]

In [13]:
for col in cambios_a_minuscula:
    df[col] = df[col].apply(lambda dato: dato.lower() if type(dato) == str else dato)

In [14]:
df[["department", "educationfield", "attrition", "jobrole", "maritalstatus", "over18", "overtime", "standardhours", "roledepartament", "remotework"]]

,department,educationfield,attrition,jobrole,maritalstatus,over18,overtime,standardhours,roledepartament,remotework
age,,,,,,,,,,
51,NaN,NaN,no,research director,NaN,y,no,full time,NaN,yes
52,NaN,life sciences,no,manager,NaN,NaN,NaN,NaN,NaN,1
42,research & development,technical degree,no,manager,married,NaN,no,NaN,manager - research & development,1
47,NaN,medical,no,research director,married,y,NaN,full time,NaN,false
46,NaN,technical degree,no,sales executive,divorced,y,no,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...
43,NaN,medical,no,research scientist,single,NaN,NaN,NaN,NaN,yes
47,NaN,NaN,no,manager,married,y,no,full time,NaN,false
29,NaN,NaN,no,research scientist,NaN,NaN,no,part time,NaN,false
47,NaN,life sciences,no,manufacturing director,divorced,NaN,yes,part time,NaN,yes
32,NaN,life sciences,no,research scientist,single,y,yes,part time,NaN,0

**Transformamos: columna `maritalstatus` 1 dato mal escritos**

In [15]:
df["maritalstatus"].value_counts()

maritalstatus
married     455
single      343
divorced    205
Name: count, dtype: int64

In [16]:
df["maritalstatus"] = df["maritalstatus"].replace("marreid", "married")

In [17]:
df["maritalstatus"].value_counts()

maritalstatus
married     455
single      343
divorced    205
Name: count, dtype: int64

**Transformamos: valores NaN por 'non-travel' en columna ``businesstravel`` basados en la información que nos ha proporcionado nuestro enlace con el proyecto**

In [18]:
df["businesstravel"] = df["businesstravel"].fillna("non-travel")

In [19]:
df['businesstravel'].value_counts()

businesstravel
non-travel           894
travel_rarely        616
travel_frequently    168
Name: count, dtype: int64

**Transformamos: espaciado sobrante en valores de la columna ``department``, ``jobrole`` y ``educationfield``**

In [20]:
print(df['department'].unique())
print('-------------')
print(df['jobrole'].unique())
print(df['educationfield'].unique())

[nan 'research & development' 'sales' 'human resources']
-------------
['research director' 'manager' 'sales executive' 'manufacturing director'
 'research scientist' 'healthcare representative' 'laboratory technician'
 'sales representative' 'human resources']
[nan 'life sciences' 'technical degree' 'medical' 'other' 'marketing'
 'human resources']

In [21]:
def sin_espaciado_extra(series):
    return series.str.strip().str.replace(r'\s+', ' ', regex=True)

columnas_a_limpiar = ['department', 'jobrole', 'educationfield']  # Ejemplo de columnas

for c in columnas_a_limpiar:

    if c in df.columns:  
        df[c] = sin_espaciado_extra(df[c])

In [22]:
print(df['department'].unique())
print('-------------')
print(df['jobrole'].unique())
print('-------------')
print(df['educationfield'].unique())

# no nos hace falta limpiar 'roledepartment' porque está destinada a eliminación

[nan 'research & development' 'sales' 'human resources']
-------------
['research director' 'manager' 'sales executive' 'manufacturing director'
 'research scientist' 'healthcare representative' 'laboratory technician'
 'sales representative' 'human resources']
-------------
[nan 'life sciences' 'technical degree' 'medical' 'other' 'marketing'
 'human resources']

**DROP Columns - `employeecount`, `sameasmonthlyincome`,`numberchildren`, `over18`, `yearsincurrentrole`**

In [23]:
df = df.drop(['employeecount', 'sameasmonthlyincome', 'numberchildren', 'over18', 'yearsincurrentrole'], axis=1)

In [24]:
df.head(2)

,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,datebirth,salary,roledepartament,remotework
age,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
51,no,non-travel,2015.72,NaN,6,3,NaN,1,1,0,NaN,3,5,research director,3,NaN,NaN,NaN,7,no,13,NaN,3,full time,0,NaN,5,NaN,20,15,15,1972,NaN,NaN,yes
52,no,non-travel,2063.39,NaN,1,4,life sciences,2,3,0,NaN,2,5,manager,3,NaN,NaN,NaN,0,NaN,14,NaN,1,NaN,1,NaN,5,NaN,33,11,9,1971,NaN,NaN,1

KEEP en BBDD pero no en CSV: 
- numberchildren (todos nan, pero puede ser interesante para la empresa en el futuro)

**DROP Duplicate Rows - `employeenumber` - keep first, reset index**

Duplicados borrados, quardamos solo el primero, reset indice del df.

In [25]:
df = df.drop_duplicates(subset='employeenumber', keep='first').reset_index(drop=True)

In [26]:
df['employeenumber'].duplicated().any()

np.False_

**REPLACE `genders` - 0 = m, 1 = f**

In [27]:
df['gender'] = df['gender'].replace({0: 'm', 1: 'f'})

**REPLACE `maritalstatus` - NaN por "unknown"**

In [28]:
df['maritalstatus'].isna().sum()

np.int64(651)

In [29]:
df['maritalstatus'] = df['maritalstatus'].fillna('unknown')

**REPLACE `overtime` TBD - NaN por "unknown" o "no"**

In [30]:
# df['overtime'] = df['overtime'].fillna('unknown' OR 'no')

In [31]:
# df['overtime'].isna().sum()

**FILLNA `standardhours` - NaN = full time (dice Pili)**

In [32]:
df['standardhours'] = df['standardhours'].fillna('full time')

**GUARDAR datos limpios a .csv nuevo "raw_data_limpio.csv"**

In [33]:
df.to_csv("raw_data_limpio_2.csv", index=False)

In [ ]:
df.shape
# raw_data.csv original: 1678 rows, 41 columns
# raw_data_limpio_2.csv: 1614 rows, 35 columns

(1614, 35)